import 'dart:ui';

double appBarHeight = 0;
final List<String> pages = ["Home", "Menu"];
final Color mainColor = Color.fromARGB(255, 198, 167, 94);
final Color parmigianoGoldColor = Color(0xFFC9A227);
int currentPageIndex = 1; //provider
int currentSubMenuIndex = 0;

final String mainPageInfoText = "Experience traditional Italian recipes prepared with passion. From handmade pasta to wood-fired pizza, every dish brings a piece of Italy to your table.";
final String mainPageTitleText = "Authentic Italian Taste";

final List<String> subMenu = [
  "Աղանդեր", "Աղցաններ", "Ապուրներ", "Արագ սնունդ", "Զովացուցիչ ըմպելիքներ", "Խավարտներ", "Խմիչքներ", "Նախուտեստ", "Ռավիոլի", "Պաստա", "Պիցցա", "Սեթ Գարեջրի հետ", "Տաք ուտեստներ",
];

final List<double> locations = [0, ];

final Map<String, List<List<String>>> menu = {
  "Աղանդեր" : [
    ["Բրաունի",	"1 հատ / 160գ",	"1500",	"Ձու, շաքարավազ, կաթ, կակաո, սոդա, ալյուր", ".jpg"],
    ["Էստերհազի",	"1 հատ / 170գ",	"1900",	"Ձու, շաքարավազ, ալյուր, եգիպտացորենի ալյուր, նուշի այլուր, դարչին, կարագ, խտացրած կաթ, կոնյակ", ".jpg"],
    ["Շոկմանժե",	"1 հատ / 110գ",	"1000",	"Ձու, շաքարավազ, դառը շոկոլադ, կարագ, կոնյակ"".jpg", "."],
    ["Շտրուդել բալով",	"1 հատ / 120գ",	"1500",	"Ձու, շաքարավազ, փխրեցուցիչ, կակաո, վանիլին, սերուցք, բալ", ".jpg"],
    ["Չիզքեյք Նյու-Յորք",	"1հատ / 180գ",	"1500",	"Ձու, շաքարավազ, վանիլ, ալյուր, կրեմ-չիզ, սերուցք, օսլա, դարչին", ".jpg"],
    ["Չիզքեյք պիստակի մածուկով",	"1հատ / 180 գ",	"2200",	"Ձու, շաքարավազ, կրեմ-չիզ, սերուցք, ալյուր, օսլա, պիստակի մածուկ", ".jpg"],
    ["Չիզքեյք Սան-Սեբաստիան", "1 հատ / 150 գրամ", "2200", "Վանիլին, օսլա, սերուցք քաղցր, շաքարավազ, ձու, պանիր կրեմչիզ", "."],
    ["Սև անտառ",	"1 հատ / 170գ",	"1300",	"Ձու, շաքարավազ, ալյուր, շոկոլադ, կակաո, կարագ", ".jpg"],
    ["Տիրամիսու պիստակի մածուկով",	"1 հատ / 150գ",	"1900",	"Ձու, շաքարավազ, մասկարպոնե, սուրճ, սերուցք, պիստակի մածուկ", ".jpg"],
    ["Տիրամիսու", "1 հատ / 150 գրամ", "1500", "Քաղցր սերուցք, ձու, շաքարավազ, պանիր մասկարպոնե", "."],
    ["Ֆոնդան",	"1 հատ / 140գ",	"1600",	"Ձու,շաքարավազ,ալյուր,շոկոլադ,կարագ", ".jpg"],
  ],
  "Աղցաններ" : [
    ["Ամառային", 	"300 գրամ",	"1200",	"Լոլիկ, վարունգ, կալամատա, մոցարելլա, սոխ, քամած մածուն", ".jpg"],
    ["Բանջարեղենային", "340 գրամ", "1500", "Քինուա, կիտրոն, լոլիկ չերի, գազար, վարունգ, ավոկադո, բազիլիկ", "."],
    ["Բուրատա",	"390 գրամ",	"4200",	"Բուրատա պանիր, չերի լոլիկ, ռուկոլա, ավոկադո", ".jpeg"],
    ["Դի պոլո կոն մանգո",	"300 գրամ",	"3400",	"Հավի կրծքամիս, մանգո, միքս աղցան, չերի լոլիկ, ավոկադո", ".jpeg"],
    ["Լամոռա",	"200 գրամ",	"1800",	"Ֆետա պանիր, տապակած վարունգ, ռուկոլա, չիլի պղպեղ, սխտոր", ".jpeg"],
    ["Կապրեզե",	"400 գրամ",	"2300",	"Ֆրեշ մոցարելլա, լոլիկ, պեստո սոուս", ".png"],
    ["Կարմիր",	"300 գրամ",	"1800",	"Բազուկ, ռուկոլա, չերի լոլիկ, կրեմ չիզ", ".jpeg"],
    ["Կեսար ծովախեցգետնով",	"515գրամ",	"2800",	"Ծովախեցգետին, պարմեզան, չինական կաղամբ, հազար, լոլիկ, կեսարի սոուս", "."],
    ["Կեսար հավով", "515 գրամ", "1300", "", "."],
    ["Կեսար",	"515 գրամ",	"2400",	"Հավի կրծքամիս, պարմեզան, չինական կաղամբ, լոլիկ", ".jpeg"],
    ["Ստեյք աղցան",	"280 գրամ",	"3700",	"Հորթի միս, պարմեզան, միքս աղցան, ճակնդեղ, սոուս", ".jpeg"],
    ["Ստրաչատելլա Դի պոմոդորո",	"250 գրամ",	"2700",	"Պանիր ստրաչատելլա, լոլիկ, ռուկոլա, սոուս", ".jpg"],
  ],
  "Ապուրներ" : [
    ["Դդմով",	"300 գրամ",	"1500",	"Դդում, կարտոֆիլ, կարմիր սոխ, կոկոսի կաթ, սերուցք, բագետ", "."],
    ["Էդամամեով", "300 գրամ", "1500", "", "."],
    ["Հավի ապուր", 	"300 գրամ",	"1300",	"Հավի կրծքամիս, գազար, գլուխ սոխ, բագետ", "."],
    ["Մինիստրոնե հորթի մսով",	"300 գրամ",	"1600",	"Հորթի միս, կարտոֆիլ, սպիտակ լոբի, սոխ, ցուկինի, գազար, բագետ", "."],
    ["Պանրով",	"320 գրամ",	"1400",	"Հալած պանիր, պարմեզան, մոցարելլա, սերուցք, բագետ", ".jpg"],
    ["Սնկապուր",	"300 գրամ",	"1200",	"Կարտոֆիլ, գազար, սունկ, սխտոր, թթվասեր, գլուխ սոխ", "."],
    ["Սնկով կրեմ ապուր", "300 գրամ", "1500", "", "."],
  ],
  "Արագ սնունդ" : [
    ["Պանինի բեկոնով",	"350 գրամ",	"1800",	"Բեկոն, կրեմ չիզ, ռուկոլա, կապերս", ".webp"],
    ["Պանինի մորտադելլայով",	"350 գրամ",	"2000",	"Մորտադելլա, ֆրեշ մոցարելլա, կապերս, այսբերգ, պիստակ", ".webp"],
    ["Պանինինի պրոշուտոյով",	"350 գրամ",	"2500",	"Պրոշուտո, ռուկոլա, մայոնեզ", ".webp"],
    ["Պարմիջիանո Պանինի",	"4100 գրամ",	"13000",	"Հորթի ֆարշ, բեկոն, ֆրի, պարմեզան, չեդդեր, թարմ վարունգ, սնկի սոուս, ֆիրմային սոուս", ".webp"],
    ["Ցեզար ռոլլ խոզի մսով",	"1 հատ/350գ",	"1700",	"Խոզի միս, գաուդա, հազար, լոլիկ", ".webp"],
    ["Ցեզար ռոլլ հավի մսով",	"1 հատ/350գ",	"1400",	"Հավի միս, գաուդա, հազար, լոլիկ", ".webp"],
    ["Ցեզար ռոլլ հորթի մսով", 	"1 հատ/350գ",	"2000",	"Հորթի միս, գաուդա, հազար, լոլիկ", ".webp"],
  ],
  "Զովացուցիչ ըմպելիքներ" : [ //
    ["Կոկա Կոլա 0.5լ",	"1 հատ",	"400", "", ".jpg"],
    ["Հանքային ջուր 330մլ",	"1 հատ",	"400", "", ".jpg"],
    ["Սպրայտ 0.5լ",	"1 հատ",	"400", "", ".jpg"],
    ["Ֆանտա 0.5լ",	"1 հատ",	"400", "", ".jpg"]
  ],
  "Խավարտներ" : [
    // ["gyuxakan kartofil"]
    ["Գրիլ բանջարեղեն",	"350 գրամ",	"2000",	"Կարմիր ճակնդեղ, սմբուկ, դդմիկ, լոլիկ, սունկ, գազար, բուլղարական պղպեղ, բրոկոլի", ".jpg"],
    ["Կարտոֆիլ ֆրի կետչուպով և պանրային սոուսով",	"250 գրամ",	"1000",	"Կարտոֆիլ, սոուս", ".jpg"],
    ["Սպանախ", "150 գրամ", "1000", "Սպանախ, ձու", "."],
    ["Խավիար", "250 գրամ", "1200", "", "."],
    ["Պյուրե", "300 գրամ", "700", "", "."]
  ],
  "Խմիչքներ" : [ //
    ['Գարեջուր Կոռոնա Էքստրա',	'330 մլ',	"1400", "", "."],
    ['Գարեջուր Հեինիկեն',	"330 մլ",	"1200", "", "."],
    ['Լիկյոր Գալիանո Լ՛Ապերիտիվո', '50 մլ', '1800', '', '.'],
    ['Լիկյոր Գալիանո Լ՛Օտենտիկո', '50 մլ', '1800', '', '.'],
    ['Լիկյոր Ջեք Դենիելս 40%', '50 մլ', '2200', '', '.'],
    ['Լիկյոր Ջեք Դենիելս խնձոր', '50 մլ', '2200', '', '.'],
    ['Լիկյոր Ջեք Դենիելս մեղր', '50 մլ', '2200', '', '.'],
    ['Լիկյոր Ֆերնետ-Բրանկա', '50 մլ', '2000', '', '.'],
    ['Կոնյակ Արարատ 3տ', '50 մլ', '1200', '', '.'],
    ['Կոնյակ Արարատ 5տ', '50 մլ', '1300', '', '.'],
    ['Կոնյակ Արարատ 7տ', '50 մլ', '2000', '', '.'],
    ['Կոնյակ Արարատ Ախթամար', '50 մլ', '3000', '', '.'],
    ['Կոնյակ Արարատ Նաիրի', '50 մլ', '6500', '', '.'],
    ['Կոնյակ Արարատ Վասպուրական', '50 մլ', '4200', '', '.'],
    ['Կոնյակ Հենեսի VSOP', '50 մլ', '5500', '', '.'],
    ['Ջին Բոմբեի Շաֆիր', '50 մլ', '2000', '', '.'],
    ['Ջին Հենդրիկ՛Ս', '50 մլ', '3200', '', '.'],
    ['Ռոմ Անգոստուրա 3տ.', '50 մլ', '2200', '', '.'],
    ['Ռոմ Անգոստուրա 7տ.', '50 մլ', '3000', '', '.'],
    ['Վերմուտ Բիանկո Կարպանո', '50 մլ', '1000', '', '.'],
    ['Վիսկի Բալանթայնս ընտիր', '50 մլ', '2000', '', '.'],
    ['Վիսկի Չիվաս Ռեգալ 12տ.', '50 մլ', '3000', '', '.'],
    ['Վիսկի Չիվաս Ռեգալ 18տ.', '50 մլ', '6000', '', '.'],
    ['Վիսկի Ջիմ Բիմ սպիտակ', '50 մլ', '2500', '', '.'],
    ['Տեկիլա Դոն Խուլիո Բլանկո', '50 մլ', '3500', '', '.'],
    ['Տեկիլա Դոն Խուլիո Ռեպոսադո', '50 մլ', '3700', '', '.'],
    ['Տեկիլա Պատրոն Անյեխո', '50 մլ', '3200', '', '.'],
    ['Տեկիլա Սե Բուսկա Ռեպոսադո', '50 մլ', '3000', '', '.'],
    ['Տեկիլա Սիերա Բլանկո', '50 մլ', '1200', '', '.'],
    ['Տեկիլա Սիերա Ռեպոսադո', '50 մլ', '1300', '', '.'],
    ['Տեկիլա Օլմեկա Գոլդ', '50 մլ', '1700', '', '.'],
  ],
  "Նախուտեստ" : [
    // siciliakan miqs
    ["Աֆֆետատո միստո",	"500 գրամ",	"5000",	"Սալյամի, իտալական երշիկ, պեպերոնի, պրոշուտտո, մորթադելլա, հորթի մսով ռուլետ", ".webp"],
    ["Բրուսկետա կապրեզե",	"350 գրամ",	"1500",	"Բագետ, ֆրեշ մոցարելլա, լոլիկ, պեստո սոուս", ".webp"],
    ["Բրուսկետա մորտադելայով",	"250 գրամ",	"1800",	"Բագետ, մորթադելլա, կրեմ չիզ, կապերս, կալամատա, պիստակ", ".webp"],
    ["Բրուսկետա սաղմոնով",	"400 գրամ",	"2400",	"Բագետ, կրեմ չիզ, սաղմոն, վարունգ, ռուկոլա, ավոկադո", ".webp"],
    ["Իտալական միքս",	"1000 գրամ",	"7000",	"Սալյամի, մորթադելլա, պրոշուտտո, երշիկ ապխտած, բեկոն, դորբլյու, ստրաչատելլա, պարմեզան, գաուդա, ֆրեշ մոցարելլա, վարունգ, լոլիկ, գազար, բուլղարական պղպեղ, կաղամբ, կալամատա", "."],
    ["Հումուս", "220 գրամ", "1300", "", "."],
    ["Մութաբալ",	"345 գրամ",	"1500",	"Սմբուկ, քամած մածուն, թթվասեր, սխտոր, թահին", ".webp"],
    ["Պիատո դի ֆորմաջի",	"570 գրամ",	"6000",	"Դորբլյու, բուրատա, գաուդա, պարմեզան, ռիկոտա, մոցարելլա, ֆետա, ելակ, խաղող, հաղարջ, սև սալոր", ".webp"],
  ],
  "Պաստա" : [
    // taliatele spitak snkwv
    ["Բոլոնեզե", 	"410 գրամ",	"2000",	"Պաստա տալիատելլե, հորթի միս, պարմեզան", "."],
    ["Բուգատինի ծովամթերքով",	"300 գրամ",	"3000",	"Պաստա բուգատինի, միդի, ծովախեցգետին, կաղամար, պարմեզան, արաբյատա, կալամատա, սերուցք, բազիլիկ", ".webp"],
    ["Դասական լազանյա",	"350 գրամ", 	"2000",	"Պաստա լազանյա, հորթի միս, գաուդա, պարմեզան, բեշամել սոուս", ".webp"],
    ["Լինգուինի ծովախեցգետնով", "200 գրամ", "2700", "", "."],
    ["Լինգուինի Պեստո",	"200 գրամ",	"2000",	"Պաստա սպագետի, պարմեզան, լոլիկի չիր, սերուցք", ".webp"],
    ["Կարբոնարա",	"250 գրամ",	"2200",	"Պաստա սպագետի, բեկոն, պարմեզան, դեղնուց", ".webp"],
    ["Պաստա սաղմոնով",	"500 գրամ", 	"3000",	"Պաստա սպագետի, սաղմոն, կրեմ չիզ", ".webp"],
    ["Պենե", "350 գրամ", "1800", "Պաստա պենե, պարմեզան, լոլիկի չիր, սխտոր, պելատի", "."],
    ["Ռիգատոնի սալյամիով",	"300 գրամ",	"2500",	"Պաստա ռիգատոնի, սալյամի, պարմեզան, կալամատա, հալապենյո, տաբասկո", ".webp"],
    ["Տորտիլիոնի ֆորմաջի", "300 գրամ", "2500", "", "."],
    ["Ֆետուչինի Ալֆրեդո",	"300 գրամ",	"2200",	"Պաստա ֆետուչինի, հավի կրծքամիս, պարմեզան, շամպինյոն, սերուցք", ".webp"],
  ],
  "Ռավիոլի": [
    // spanaxov // 1900 dr // 120 gr
    ["Ռավիոլի  հորթի մսով",	"370 գրամ",	"2400",	"Հորթի միս, պելատի սոուս", ".webp"],
    ["Ռավիոլի Ծովախեցգետնով",	"250 գրամ",	"3000",	"Ծովախեցգետին, ռիկոտա, սերուցքային սոուս", "."],
    ["Ռավիոլի սնկով",	"140 գրամ",	"2000",	"Սունկ, պանիր ռիկոտա, սերուցքային սոուս", ".webp"],
  ],
  "Պիցցա" : [
    ["Արտիշոկով",	"32 սմ /500գ",	"2800",	"Արտիշոկ, դորբլյու, մոցարելլա", ".jpeg"],
    ["Բանջարեղենային", "32 սմ /480գ", "1800", "", "."],
    ["Բուրրատա",	"32 սմ /550գ",	"4000",	"Պեստո սոուս, մոցարելլա, լոլիկ, ռուկոլա", ".jpeg"],
    ["Դոլչե ",	"32 սմ/500գ",	"2500",	"Նուտելլա, բանան, ելակ, հապալաս, նանա, մասկարպոնե, նանա", ".jpeg"],
    ["Լա Չիպոլլա",	"32 սմ/540գ",	"2600",	"Սալյամի, պաշինա, խոզապուխտ, բուլղարական պղպեղ, զեյթուն, բազիլիկ", ".jpg"],
    ["Կապրեզե",	"32 սմ /510գ",	"3200",	 "Ֆրեշ մոցարելլա, մոցարելլա, լոլիկ, պեստո", ".jpg"],
    ["Կվադրո Ստաջիոնե",	"32 սմ/535գ",	"2600",	"Խոզապուխտ, բեկոն, մոցարելլա, արտիշոկ, լոլիկ, բուլղարական պղպեղ, սունկ", ".jpeg"],
    ["Մարգարիտա", "32սմ/510գ",	"1800",	"Մոցարելլա, բազիլիկ", ".jpg"],
    ["Մարսելեզե",	"32սմ/530գ",	"2500",	"Հավի կրծքամիս, մոցարելլա, սունկ, սոխ, սերուցք", ".jpeg"],
    ["Մորթադելլա",	"32սմ/500գ", "2400",	"Մորթադելլա, մոցարելլա, կապերս", ".jpg"],
    ["Պարմիջիանո",	"32սմ/530գ",	"3500",	"Դորբլյու, պարմեզան, մոցարելլա, չեդդեր, հալած պանիր", ".jpeg"],
    ["Պեպերոնի",	"32 սմ /550գ",	"2000",	"Պանիր մոցառելլա, երշիկ պեպերոնի, ձիթապտղի յուղ", ".jpeg"],
    ["Պրոշուտո",	"32 սմ /550գ",	"3200",	"Պանիր մոցարելլա, պրոշուտո, կրեմ-չիզ, ռուկոլա, սունկ", ".jpg"],
    ["Տոսկանա",	"32սմ/540գ",	"2500",	"Հավի կրծքամիս, մոցարելլա ,սունկ, կանաչի, կարմիր բարբեքյու սոուս", ".jpeg"],
  ],
  "Սեթ Գարեջրի հետ" : [
    // de mare // 6500
    ["Գուստո Բիրրա",	"300 գրամ", 	"3900",	"Ջերկի տավարի, ջերկի հավի, չիպս, սիսեռ, պիստակ, չորահաց", ".webp"],
    ["Տալիերե Բիրրա",	"450 գրամ",	"3000",	"Ռիբս, նրբերշիկ, կարտոֆիլ", ".webp"],
    ["Տալիերե դի Ամիչի",	"900 գրամ",	"4900",	"Ռիբս, խոզի մատիկներ իտալական ձևով, հավի թևիկ, նրբերշիկ, տապակած պանիր, կարտոֆիլ", ".webp"],
  ],
  "Տաք ուտեստներ" : [
    // sibas // 5000
    // saxmon bbq // 18000
    ["Բադի կրծքամիս",	"400 գրամ",	"3700",	"Բադի կրծքամիս, գազար, բալի սոուս", ".webp"],
    ["Գառան թիակ", "1 կգ", "15000", "Գառան միս,դդմիկ,բուլղարական պղպեղ,լոլիկ ,սուս", "."],
    ["Գառի խորոված",	"1000 գրամ",	"10000",	"Միս գառան, սոուս կիմչի, թթվի տեսականի, մանանեխ, ձու", ".webp"],
    ["Դորադո բանջարեղենով", "600 գրամ", "6500","Բրոկոլի, Դորադո, Էդամամե, լայմ, գազար, լոլիկ, պելատի", "."],
    ["Թառափ մանղալի վրա",	"1000 գրամ",	"9000",	"Թառափ, համեմունք", ".webp"],
    ["Իշխան", "1000 գրամ", "6000", "", "."],
    ["Խոզի ԲԲՔ",	"10000 գրամ",	"8000",	"Խոզի միս, աղ, համեմունք", ".webp"],
    ["Խոզի սթեյք",	"250 գրամ",	"3000",	"Խոզի միս, կարտոֆիլ, միքս աղցան, չերի լոլիկ, սոուս պելատի", ".webp"],
    ["Խորոված ճուտ", "375 գրամ", "2000","Ճուտ, Ձեթ, ուրց, դաղձ", "."],
    ["Ծովախեցգետին բանջարեղենով",	"320 գրամ",	"3900",	"Ծովախեցգետին, գազար, կարտոֆիլ, էդամամե, կանաչ սոխ, պեստո սոուս", ".webp"],
    ["Կարոլետտա այի ֆունգի պորչինի",	"100 գրամ",	"10000",	"Հորթի ֆարշ, սպիտակ սունկ, սոուս", "."],
    ["Կարոլետտա կոն մոցարելա",	"100 գրամ",	"10000",	"Հորթի ֆարշ, մոցարելլա, սոուս", ".webp"],
    ["Հավի սթեյք",	"200 գրամ",	"2400",	"Հավի կրծքամիս, ավոկադո, չերի լոլիկ, սոուս", ".webp"],
    ["Հորթի ԲԲՔ", "1 կգ", "9000", "Հորթի միս, սոուս, սոխ, կանաչի", "."],
    ["Նյու-Յորքյան Բենեդիկտ",	"300 գրամ",	"2300",	"Ձու պաշոտ, բեկոն, բագետ, չերրի լոլիկ, ավոկադո", ".webp"],
    ["Ռիբս",	"400 գրամ",	"4000",	"Տապակած կարտոֆիլ, խոզի կողիկներ, բարբիքյու սոուս", ".webp"],
    ["Սաղմոնի սթեյք",	"200 գրամ",	"6000",	"Սաղմոն, բիարնեզե սոուս, միքս աղցան, կրեմ չիզ", ".webp"],
    ["Սթեյք Ստրիպլոյն",	"500 գրամ",	"7000",	"Սխտոր, պելատի, ձեթ, համեմունք, պանիր պարմեզան, լայմ, կիտրոն, պղպեղ բուլղարական, եգիպտացորեն, դդմիկ, բազիլիկ", ".webp"],
    ["Ստինկո",	"2000 գրամ",	"11000",	"Խոզի մաչա, ամառային խորոված, տապակած կարտոֆիլ, մանանեխի սոուս", ".webp"],
    ["Օսոբուկո", "2000 գրամ",	"12000",	"Բրինձ արբորիո, հորթի մաչա, պարմեզան, կարագ, սունկ, ռոզմարին, չիլի, պղպեղ", ".webp"],
    ["Ֆիլե Մինյոն սթեյք",	"700 գրամ",	"5000",	"Հորթի ֆիլե, կարտոֆիլ պյուրե, ձնեբեկ, դեմի-գլաս սոուս, պարմեզան", ".webp"],
  ],
};