import 'dart:ui';

double appBarHeight = 0;
final List<String> pages = ["Home", "Menu"];
final Color mainColor = Color.fromARGB(255, 198, 167, 94);
final Color parmigianoGoldColor = Color(0xFFC9A227);
int currentPageIndex = 1; //provider
int currentSubMenuIndex = 0;

final String mainPageInfoText = "Experience traditional Italian recipes prepared with passion. From handmade pasta to wood-fired pizza, every dish brings a piece of Italy to your table.";
final String mainPageTitleText = "Authentic Italian Taste";

final List<String> subMenu = [
  "Աղանդեր", "Աղցաններ", "Ապուրներ", "Արագ սնունդ", "Զովացուցիչ ըմպելիքներ", "Խավարտներ", "Խմիչքներ", "Նախուտեստ", "Պաստա", "Պիցցա", "Սեթ Գարեջրի հետ", "Տաք ուտեստներ",
];

final List<double> locations = [0, ];

final Map<String, List<List<String>>> menu = {
  "Աղանդեր" : [
    ["Բրաունի",	"1 հատ / 160գ",	"1950",	"Ձու, շաքարավազ, կաթ, կակաո, սոդա, ալյուր", ".jpg"],
    ["Շոկ մանժե",	"1 հատ / 110գ",	"1300",	"Ձու, շաքարավազ, դառը շոկոլադ, կարագ, կոնյակ"".jpg", ".jpg"],
    ["Էստերհազի",	"1 հատ / 170գ",	"2500",	"Ձու, շաքարավազ, ալյուր, եգիպտացորենի ալյուր, նուշի այլուր, դարչին, կարագ, խտացրած կաթ, կոնյակ", ".jpg"],
    ["Շտրուդել բալով",	"1 հատ / 120գ",	"1950",	"Ձու, շաքարավազ, փխրեցուցիչ, կակաո, վանիլին, սերուցք, բալ", ".jpg"],
    ["Չիզքեյք Նյու-Յորք",	"1հատ / 180գ",	"1950",	"Ձու, շաքարավազ, վանիլ, ալյուր, կրեմ-չիզ, սերուցք, օսլա, դարչին", ".jpg"],
    ["Չիզքեյք պիստակի մածուկով",	"1հատ / 180 գ",	"2900",	"Ձու, շաքարավազ, կրեմ-չիզ, սերուցք, ալյուր, օսլա, պիստակի մածուկ", ".jpg"],
    ["Սև անտառ",	"1 հատ / 170գ",	"1700",	"Ձու, շաքարավազ, ալյուր, շոկոլադ, կակաո, կարագ", ".jpg"],
    ["Տիրամիսու պիստակի մածուկով",	"1 հատ / 150գ",	"2500",	"Ձու, շաքարավազ, մասկարպոնե, սուրճ, սերուցք, պիստակի մածուկ", ".jpg"],
    ["Ֆոնդան",	"1 հատ / 140գ",	"2100",	"Ձու,շաքարավազ,ալյուր,շոկոլադ,կարագ", ".jpg"],
  ],
  "Աղցաններ" : [
    ["Բուրատա",	"390 գրամ",	"5500",	"Բուրատա պանիր, չերի լոլիկ, ռուկոլա, ավոկադո", ".jpeg"],
    ["Ստեյք աղցան",	"280 գրամ",	"4850",	"Հորթի միս, պարմեզան, միքս աղցան, ճակնդեղ, սոուս", ".jpeg"],
    ["Դի պոլո կոն մանգո",	"300 գրամ",	"4450",	"Հավի կրծքամիս, մանգո, միքս աղցան, չերի լոլիկ, ավոկադո", ".jpeg"],
    ["Ամառային", 	"300 գրամ",	"1600",	"Լոլիկ, վարունգ, կալամատա, մոցարելլա, սոխ, քամած մածուն", ".jpg"],
    ["Կեսար ծովախեցգետնով",	"515գրամ",	"3650",	"Ծովախեցգետին, պարմեզան, չինական կաղամբ, հազար, լոլիկ, կեսարի սոուս", ".png"],
    ["Ստրաչատելլա Դի պոմոդորո",	"250 գրամ",	"3550",	"Պանիր ստրաչատելլա, լոլիկ, ռուկոլա, սոուս", ".jpg"],
    ["Կեսար",	"515 գրամ",	"3150",	"Հավի կրծքամիս, պարմեզան, չինական կաղամբ, լոլիկ", ".jpeg"],
    ["Կապրեզե",	"400 գրամ",	"3000",	"Ֆրեշ մոցարելլա, լոլիկ, պեստո սոուս", ".png"],
    ["Լամոռա",	"200 գրամ",	"2350",	"Ֆետա պանիր, տապակած վարունգ, ռուկոլա, չիլի պղպեղ, սխտոր", ".jpeg"],
    ["Կարմիր",	"300 գրամ",	"2350",	"Բազուկ, ռուկոլա, չերի լոլիկ, կրեմ չիզ", ".jpeg"],
  ],
  "Ապուրներ" : [
    ["Պանրով",	"320 գրամ",	"1850",	"Հալած պանիր, պարմեզան, մոցարելլա, սերուցք, բագետ", ".jpg"],
    ["Դդմով",	"300 գրամ",	"1950",	"Դդում, կարտոֆիլ, կարմիր սոխ, կոկոսի կաթ, սերուցք, բագետ", ""],
    ["Սնկապուր",	"300 գրամ",	"1950",	"Կարտոֆիլ, գազար, սունկ, սխտոր, թթվասեր, գլուխ սոխ", ""],
    ["Հավի ապուր", 	"300 գրամ",	"1700",	"Հավի կրծքամիս, գազար, գլուխ սոխ, բագետ", ""],
    ["Մինիստրոնե հորթի մսով",	"300 գրամ",	"2100",	"Հորթի միս, կարտոֆիլ, սպիտակ լոբի, սոխ, ցուկինի, գազար, բագետ", ""],
  ],
  "Արագ սնունդ" : [
    ['Պանինի բեկոնով',	'350 գրամ',	'2400',	'Բեկոն, կրեմ չիզ, ռուկոլա, կապերս', '.webp'],
    ['Պարմիջիանո Պանինի',	'4100 գրամ',	'16900',	'Հորթի ֆարշ, բեկոն, ֆրի, պարմեզան, չեդդեր, թարմ վարունգ, սնկի սոուս, ֆիրմային սոուս', '.webp'],
    ['Պանինի մորտադելլայով',	'350 գրամ',	'2600',	'Մորտադելլա, ֆրեշ մոցարելլա, կապերս, այսբերգ, պիստակ', '.webp'],
    ['Պանինինի պրոշուտոյով',	'350 գրամ',	'3300',	'Պրոշուտո, ռուկոլա, մայոնեզ', '.webp'],
    ['Ցեզար ռոլլ հորթի մսով', 	'1 հատ/350գ',	'2600',	'Հորթի միս, գաուդա, հազար, լոլիկ', '.webp'],
    ['Ցեզար ռոլլ խոզի մսով',	'1 հատ/350գ',	'2200',	'Խոզի միս, գաուդա, հազար, լոլիկ', '.webp'],
    ['Ցեզար ռոլլ հավի մսով',	'1 հատ/350գ',	'1800',	'Հավի միս, գաուդա, հազար, լոլիկ', '.webp']
  ],
  "Զովացուցիչ ըմպելիքներ" : [
    ['Կոկա Կոլա 0.5լ',	'1 հատ',	'520', '', '.jpg'],
    ['Հանքային ջուր 330մլ',	'1 հատ',	'520', '', '.jpg'],
    ['Սպրայտ 0.5լ',	'1 հատ',	'520', '', '.jpg'],
    ['Ֆանտա 0.5լ',	'1 հատ',	'520', '', '.jpg']
  ],
  "Խավարտներ" : [
    ['Գրիլ բանջարեղեն',	'350 գրամ',	'2600',	'Կարմիր ճակնդեղ, սմբուկ, դդմիկ, լոլիկ, սունկ, գազար, բուլղարական պղպեղ, բրոկոլի', '.jpg'],
    ['Կարտոֆիլ ֆրի կետչուպով և պանրահին սոուսով',	'50 գրամ',	'1300',	'Կարտոֆիլ, սոուս', '.jpg']
  ],
  "Խմիչքներ" : [
    ['Corona գարեջուր',	'330 մլ',	"1820", "", "."],
    ['Heineken գարեջուր',	"330 մլ",	"1560", "", "."]
  ],
  "Նախուտեստ" : [
    ['Աֆֆետատո միստո',	'500 գրամ',	'6500',	'Սալյամի, իտալական երշիկ, պեպերոնի, պրոշուտտո, մորթադելլա, հորթի մսով ռուլետ', '.webp'],
    ['Բրուսկետա կապրեզե',	'350 գրամ',	'1950',	'Բագետ, ֆրեշ մոցարելլա, լոլիկ, պեստո սոուս', '.webp'],
    ['Բրուսկետա սաղմոնով',	'400 գրամ',	'3100',	'Բագետ, կրեմ չիզ, սաղմոն, վարունգ, ռուկոլա, ավոկադո', '.webp'],
    ['Բրուսկետա մորտադելայով',	'250 գրամ',	'2080',	'Բագետ, մորթադելլա, կրեմ չիզ, կապերս, կալամատա, պիստակ', '.webp'],
    ['Իտալական միքս',	'1000 գրամ',	'9100',	'Սալյամի, մորթադելլա, պրոշուտտո, երշիկ ապխտած, բեկոն, դորբլյու, ստրաչատելլա, պարմեզան, գաուդա, ֆրեշ մոցարելլա, վարունգ, լոլիկ, գազար, բուլղարական պղպեղ, կաղամբ, կալամատա', '.webp'],
    ['Մութաբալ',	'345 գրամ',	'1950',	'Սմբուկ, քամած մածուն, թթվասեր, սխտոր, թահին', '.webp'],
    ['Պիատո դի ֆորմաջի',	'570 գրամ',	'7800',	'Դորբլյու, բուրատա, գաուդա, պարմեզան, ռիկոտա, մոցարելլա, ֆետա, ելակ, խաղող, հաղարջ, սև սալոր', '.webp']
  ],
  "Պաստա" : [
    ['Բոլոնեզե', 	'410 գրամ',	'2600',	'Պաստա տալիատելլե, հորթի միս, պարմեզան', ''],
    ['Բուգատինի ծովամթերքով',	'300 գրամ',	'3900',	'Պաստա բուգատինի, միդի, ծովախեցգետին, կաղամար, պարմեզան, արաբյատա, կալամատա, սերուցք, բազիլիկ', '.webp'],
    ['Դասական լազանյա',	'350 գրամ', 	'2600',	'Պաստա լազանյա, հորթի միս, գաուդա, պարմեզան, բեշամել սոուս', '.webp'],
    ['Լինգուինի Պեստո',	'200 գրամ',	'2600',	'Պաստա սպագետի, պարմեզան, լոլիկի չիր, սերուցք', '.webp'],
    ['Կարբոնարա',	'250 գրամ',	'2900',	'Պաստա սպագետի, բեկոն, պարմեզան, դեղնուց', '.webp'],
    ['Պաստա սաղմոնով',	'500 գրամ', 	'3900',	'Պաստա սպագետի, սաղմոն, կրեմ չիզ', '.webp'],
    ['Ռավիոլի  հորթի մսով',	'370 գրամ',	'3150',	'Հորթի միս, պելատի սոուս', '.webp'],
    ['Ռավիոլի սնկով',	'140 գրամ',	'2600',	'Սունկ, պանիր ռիկոտա, սերուցքային սոուս', '.webp'],
    ['Ռիգատոնի սալյամիով',	'300 գրամ',	'3250',	'Պաստա ռիգատոնի, սալյամի, պարմեզան, կալամատա, հալապենյո, տաբասկո', '.webp'],
    ['Ֆետուչինի Ալֆրեդո',	'300 գրամ',	'2900',	'Պաստա ֆետուչինի, հավի կրծքամիս, պարմեզան, շամպինյոն, սերուցք', '.webp'],
  ],
  "Պիցցա" : [
    ['Արտիշոկով',	'32 սմ /500գ',	'3650',	'Արտիշոկ, դորբլյու, մոցարելլա', '.jpeg'],
    ['Բուրրատա',	'32 սմ /550գ',	'5200',	'Պեստո սոուս, մոցարելլա, լոլիկ, ռուկոլա', '.jpeg'],
    ['Կապրեզե',	'32 սմ /510գ',	'4200',	 'Ֆրեշ մոցարելլա, մոցարելլա, լոլիկ, պեստո', '.jpg'],
    ['Պրոշուտո',	'32 սմ /550գ',	'4200',	'Պանիր մոցարելլա, պրոշուտո, կրեմ-չիզ, ռուկոլա, սունկ', '.jpg'],
    ['Պեպերոնի',	'32 սմ /550գ',	'2600',	'Պանիր մոցառելլա, երշիկ պեպերոնի, ձիթապտղի յուղ', '.jpeg'],
    ['Լա Չիպոլլա',	'32 սմ/540գ',	'3400',	'Սալյամի, պաշինա, խոզապուխտ, բուլղարական պղպեղ, զեյթուն, բազիլիկ', '.jpg'],
    ['Դոլչե ',	'32 սմ/500գ',	'3250',	'Նուտելլա, բանան, ելակ, հապալաս, նանա, մասկարպոնե, նանա', '.jpeg'],
    ['Տոսկանա',	'32սմ/540գ',	'3250',	'Հավի կրծքամիս, մոցարելլա ,սունկ, կանաչի, կարմիր բարբեքյու սոուս', '.jpeg'],
    ['Մարսելեզե',	'32սմ/530գ',	'3250',	'Հավի կրծքամիս, մոցարելլա, սունկ, սոխ, սերուցք', '.jpeg'],
    ['Մորթադելլա',	'32սմ/500գ', '3150',	'Մորթադելլա, մոցարելլա, կապերս', '.jpg'],
    ['Կվադրո Ստաջիոնե',	'32 սմ/535գ',	'3400',	'Խոզապուխտ, բեկոն, մոցարելլա, արտիշոկ, լոլիկ, բուլղարական պղպեղ, սունկ', '.jpeg'],
    ['Մարգարիտա', '32սմ/510գ',	'2350',	'Մոցարելլա, բազիլիկ', '.jpg'],
    ['Պարմիջիանո',	'32սմ/530գ',	'4550',	'Դորբլյու, պարմեզան, մոցարելլա, չեդդեր, հալած պանիր', '.jpeg'],
  ],
  "Սեթ Գարեջրի հետ" : [
    ['Գուստո Բիրրա',	'300 գրամ', 	'5100',	'Ջերկի տավարի, ջերկի հավի, չիպս, սիսեռ, պիստակ, չորահաց', '.webp'],
    ['Տալիերե Բիրրա',	'450 գրամ',	'3900',	'Ռիբս, նրբերշիկ, կարտոֆիլ', '.webp'],
    ['Տալիերե դի Ամիչի',	'900 գրամ',	'6400',	'Ռիբս, խոզի մատիկներ իտալական ձևով, հավի թևիկ, նրբերշիկ, տապակած պանիր, կարտոֆիլ', '.webp']
  ],
  "Տաք ուտեստներ" : [
    ['Բադի կրծքամիս',	'400 գրամ',	'4850',	'Բադի կրծքամիս, գազար, բալի սոուս', '.webp'],
    ['Թառափ մանղալի վրա',	'1000 գրամ',	'11700',	'Թառափ, համեմունք', '.webp'],
    ['Խոզի ԲԲՔ',	'10000 գրամ',	'10400',	'Խոզի միս, աղ, համեմունք', '.webp'],
    ['Խոզի սթեյք',	'250 գրամ',	'3900',	'Խոզի միս, կարտոֆիլ, միքս աղցան, չերի լոլիկ, սոուս պելատի', '.webp'],
    ['Ծովախեցգետին բանջարեղենով',	'320 գրամ',	'5100',	'Ծովախեցգետին, գազար, կարտոֆիլ, էդամամե, կանաչ սոխ, պեստո սոուս', '.webp'],
    ['Կարոլետտա կոն մոցարելա',	'1000 գրամ',	'1300',	'Հորթի ֆարշ, մոցարելլա, սոուս', '.webp'],
    ['Հավի սթեյք',	'200 գրամ',	'3150',	'Հավի կրծքամիս, ավոկադո, չերի լոլիկ, սոուս', '.webp'],
    ['Նյու-Յորքյան Բենեդիկտ',	'300 գրամ',	'3000',	'Ձու պաշոտ, բեկոն, բագետ, չերրի լոլիկ, ավոկադո', '.webp'],
    ['Ռիբս',	'400 գրամ',	'5200',	'Տապակած կարտոֆիլ, խոզի կողիկներ, բարբիքյու սոուս', '.webp'],
    ['Սաղմոնի սթեյք',	'200 գրամ',	'7800',	'Սաղմոն, բիարնեզե սոուս, միքս աղցան, կրեմ չիզ', '.webp'],
    ['Ստինկո',	'2000 գրամ',	'14300',	'Խոզի մաչա, ամառային խորոված, տապակած կարտոֆիլ, մանանեխի սոուս', '.webp'],
    ['Օսոբուկո', '2000 գրամ',	'15600',	'Բրինձ արբորիո, հորթի մաչա, պարմեզան, կարագ, սունկ, ռոզմարին, չիլի, պղպեղ', '.webp'],
    ['Ֆիլե Մինյոն սթեյք',	'700 գրամ',	'6500',	'Հորթի ֆիլե, կարտոֆիլ պյուրե, ձնեբեկ, դեմի-գլաս սոուս, պարմեզան', '.webp']
  ],
};